; domain
(define (domain blocksworld)
    (:requirements :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block) ; observed predicate
        (ontable ?x - block)  ; derived predicate
        (clear ?x - block)  ; derived predicate
        (handempty ?x - robot)  ; derived predicate
        (handfull ?x - robot)  ; derived predicate
        (holding ?x - block) ; derived predicate
    )
    (:action pick_up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put_down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld4)
(:domain blocksworld)
(:objects
    blue_block - block 
    arm - robot 
    yellow_block - block 
    orange_block - block 
    purple_block - block 
    red_block - block 
)

(:init
    ( clear blue_block )
    ( clear orange_block )
    ( clear purple_block )
    ( clear red_block )
    ( clear yellow_block )
    ( handempty arm )
    ( ontable blue_block )
    ( ontable orange_block )
    ( ontable purple_block )
    ( ontable red_block )
    ( ontable yellow_block )
)

(:goal (and (on orange_block yellow_block) (on yellow_block blue_block) (on blue_block purple_block) (on purple_block red_block)))
)

; plan
1. (pick_up orange_block arm)
   deleted: (ontable orange_block) (clear orange_block) (handempty arm)
   added: (handfull arm) (holding orange_block)
   goals met: 0 of 4
2. (stack orange_block yellow_block arm)
   deleted: (holding orange_block) (clear yellow_block) (handfull arm)
   added: (clear orange_block) (handempty arm) (on orange_block yellow_block)
   goals met: 1 of 4
3. (pick_up purple_block arm)
   deleted: (ontable purple_block) (clear purple_block) (handempty arm)
   added: (handfull arm) (holding purple_block)
   goals met: 1 of 4
4. (stack purple_block red_block arm)
   deleted: (holding purple_block) (clear red_block) (handfull arm)
   added: (clear purple_block) (handempty arm) (on purple_block red_block)
   goals met: 2 of 4
5. (pick_up blue_block arm)
   deleted: (ontable blue_block) (clear blue_block) (handempty arm)
   added: (handfull arm) (holding blue_block)
   goals met: 2 of 4
6. (stack blue_block purple_block arm)
   deleted: (holding blue_block) (clear purple_block) (handfull arm)
   added: (clear blue_block) (handempty arm) (on blue_block purple_block)
   goals met: 3 of 4
7. (unstack orange_block yellow_block arm)
   deleted: (clear orange_block) (handempty arm) (on orange_block yellow_block)
   added: (holding orange_block) (clear yellow_block) (handfull arm)
   goals met: 2 of 4
8. (put_down orange_block arm)
   deleted: (holding orange_block) (handfull arm)
   added: (clear orange_block) (handempty arm) (ontable orange_block)
   goals met: 2 of 4
9. (pick_up yellow_block arm)
   deleted: (ontable yellow_block) (clear yellow_block) (handempty arm)
   added: (handfull arm) (holding yellow_block)
   goals met: 2 of 4
10. (stack yellow_block blue_block arm)
   deleted: (holding yellow_block) (clear blue_block) (handfull arm)
   added: (clear yellow_block) (handempty arm) (on yellow_block blue_block)
   goals met: 3 of 4
11. (pick_up orange_block arm)
   deleted: (ontable orange_block) (clear orange_block) (handempty arm)
   added: (handfull arm) (holding orange_block)
   goals met: 3 of 4
12. (stack orange_block yellow_block arm)
   deleted: (holding orange_block) (clear yellow_block) (handfull arm)
   added: (clear orange_block) (handempty arm) (on orange_block yellow_block)
   goals met: 4 of 4
